week8/day2/joining/app/controllers/rooms_controller.rb

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def assign
		@subject = Subject.find(params[:id])
		room = Room.find(params[:roomid])