week8/day2/joining/app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects"
---
	def index
		@subjects = Subject.all

INSERT INTO "subjects" ("created_at", "updated_at", "topic") VALUES (?, ?, ?)  [["created_at", "2018-04-20 18:22:05.625955"], ["updated_at", "2018-04-20 18:22:05.625955"], ["topic", "History"]]
---
	def create
		subject = Subject.new(subject_params)
		if subject.save

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms"
---
	def show
		@subject = Subject.find(params[:id])
		@subject_rooms = @subject.rooms
		@rooms = Room.all